emacs-notes/.config/doom/config.org
#+title: Config
#+auto_tangle: t
#+STARTUP: showeverything
#+PROPERTY:header-args :tangle config.el
#+begin_src elisp
;; org-roam-db-location
;; org-roam-node-find
#+end_src
* Set Font
#+begin_src elisp
;; FiraCode Nerd Font
(setq doom-font (font-spec :family "JetBrainsMono Nerd Font" :size 22))
#+end_src

