emacs-notes/.config/doom/config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-31 Sat 12:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Config</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Config</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1382cbb">1. Set Font</a></li>
<li><a href="#orge0df6f7">2. ORG MODE Main org</a>
<ul>
<li>
<ul>
<li><a href="#orgb08d411">2.0.1. Make Numbered Lists</a></li>
</ul>
</li>
<li><a href="#orge0638a8">2.1. org-superstar-mode / olivetti-mode</a></li>
<li><a href="#org41168ec">2.2. org-modern-mode</a></li>
</ul>
</li>
<li><a href="#org19769c8">3. Org-preview-html-mode</a>
<ul>
<li><a href="#orgb192304">3.1. Org-auto-tangle</a></li>
<li><a href="#org6f45dfb">3.2. org roam</a></li>
<li><a href="#org026638d">3.3. org agenda</a></li>
<li><a href="#orgd8bfb8b">3.4. org download</a></li>
<li><a href="#org2fa5149">3.5. deft</a></li>
<li><a href="#org1ca3cd9">3.6. dired</a></li>
</ul>
</li>
<li><a href="#org3fdf09e">4. doom appearance</a></li>
<li><a href="#org2918245">5. OPTIMIZING</a></li>
<li><a href="#orga08d73d">6. custome function</a></li>
<li><a href="#org7947b93">7. other config</a>
<ul>
<li><a href="#orgef39344">7.1. Remembering the last place you visited in a file</a></li>
<li><a href="#orgfa0a853">7.2. Prevent using UI dialog&rsquo;s for prompts</a></li>
<li><a href="#orgd452e55">7.3. Automatically revert buffers for changed files</a></li>
<li><a href="#orgd41867e">7.4. On relative line numbers</a></li>
<li><a href="#org2dd8243">7.5. Set default shell in Emacs vterm</a></li>
<li><a href="#org3f19eb3">7.6. multi-vterm</a></li>
<li><a href="#orgccfb98c">7.7. pixel-scroll</a></li>
<li><a href="#org9a46dd0">7.8. which key</a></li>
<li><a href="#orgfc8ef20">7.9. Set Icons For Dired</a></li>
<li><a href="#orgb4c1822">7.10. BOOKMARKS AND BUFFERS</a></li>
<li><a href="#org157ca53">7.11. MU4E</a></li>
</ul>
</li>
<li><a href="#org6d7d0c5">8. theme</a></li>
<li><a href="#org7f28c75">9. wks-mode-SH</a>
<ul>
<li><a href="#orgf48b92a">9.1. flyspell enable</a></li>
</ul>
</li>
<li><a href="#orgc911d62">10. fixed backward word del</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1382cbb" class="outline-2">
<h2 id="org1382cbb"><span class="section-number-2">1.</span> Set Font</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #606F73;">;; </span><span style="color: #606F73;">FiraCode Nerd Font</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">doom-font</span> <span style="color: #53df83;">(</span><span style="color: #1abc9c;">font-spec</span> <span style="color: #1abc9c;">:family</span> <span style="color: #53df83;">"JetBrainsMono Nerd Font"</span> <span style="color: #1abc9c;">:size</span> <span style="color: #56b5c2;">22</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
</div>
