emacs-notes/.config/doom/config.html
<div id="outline-container-orge0df6f7" class="outline-2">
<h2 id="orge0df6f7"><span class="section-number-2">2.</span> ORG MODE Main org</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">map!</span> <span style="color: #1abc9c;">:leader</span>
      <span style="color: #1abc9c;">:desc</span> <span style="color: #53df83;">"Org babel tangle"</span> <span style="color: #53df83;">"m B"</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">org-babel-tangle</span><span style="color: #e74c3c;">)</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">after!</span> org
  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">org-directory</span> <span style="color: #53df83;">"~/roam/org"</span>
        <span style="color: #f8f8f0;">org-default-notes-file</span> <span style="color: #1abc9c;">(</span><span style="color: #1abc9c;">expand-file-name</span> <span style="color: #53df83;">"notes.org"</span> <span style="color: #f8f8f0;">org-directory</span><span style="color: #1abc9c;">)</span>
        <span style="color: #f8f8f0;">org-ellipsis</span> <span style="color: #53df83;">" &#8628; "</span> <span style="color: #606F73;">; </span><span style="color: #606F73;">&#8681; &#9660; &#8628;</span>
        <span style="color: #606F73;">;; </span><span style="color: #606F73;">org-superstar-headline-bullets-list '("&#9673;" "&#9679;" "&#9675;" "&#9670;" "&#9679;" "&#9675;" "&#9670;")</span>
        <span style="color: #606F73;">;; </span><span style="color: #606F73;">org-superstar-itembullet-alist '((?+ . ?&#10148;) (?- . ?&#10022;)) ; changes +/- symbols in item lists</span>
        <span style="color: #f8f8f0;">org-log-done</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">time</span>
        <span style="color: #f8f8f0;">org-hide-emphasis-markers</span> t
        <span style="color: #606F73;">;; </span><span style="color: #606F73;">ex. of org-link-abbrev-alist in action</span>
        <span style="color: #606F73;">;; </span><span style="color: #606F73;">[[arch-wiki:Name_of_Page][Description]]</span>
        <span style="color: #f8f8f0;">org-link-abbrev-alist</span>    <span style="color: #606F73;">; </span><span style="color: #606F73;">This overwrites the default Doom org-link-abbrev-list</span>
          <span style="color: #e74c3c;">'</span><span style="color: #1abc9c;">(</span><span style="color: #53df83;">(</span><span style="color: #53df83;">"google"</span> . <span style="color: #53df83;">"http://www.google.com/search?q="</span><span style="color: #53df83;">)</span>
            <span style="color: #53df83;">(</span><span style="color: #53df83;">"arch-wiki"</span> . <span style="color: #53df83;">"https://wiki.archlinux.org/index.php/"</span><span style="color: #53df83;">)</span>
            <span style="color: #53df83;">(</span><span style="color: #53df83;">"ddg"</span> . <span style="color: #53df83;">"https://duckduckgo.com/?q="</span><span style="color: #53df83;">)</span>
            <span style="color: #53df83;">(</span><span style="color: #53df83;">"wiki"</span> . <span style="color: #53df83;">"https://en.wikipedia.org/wiki/"</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span>
        <span style="color: #f8f8f0;">org-table-convert-region-max-lines</span> <span style="color: #56b5c2;">20000</span>
        <span style="color: #f8f8f0;">org-todo-keywords</span>        <span style="color: #606F73;">; </span><span style="color: #606F73;">This overwrites the default Doom org-todo-keywords</span>
          <span style="color: #e74c3c;">'</span><span style="color: #1abc9c;">(</span><span style="color: #53df83;">(</span>sequence
             <span style="color: #53df83;">"</span><span style="color: #ECBE7B; font-weight: bold;">TODO</span><span style="color: #53df83;">(t)"</span>           <span style="color: #606F73;">; </span><span style="color: #606F73;">A task that is ready to be tackled</span>
             <span style="color: #53df83;">"BLOG(b)"</span>           <span style="color: #606F73;">; </span><span style="color: #606F73;">Blog writing assignments</span>
             <span style="color: #53df83;">"GYM(g)"</span>            <span style="color: #606F73;">; </span><span style="color: #606F73;">Things to accomplish at the gym</span>
             <span style="color: #53df83;">"PROJ(p)"</span>           <span style="color: #606F73;">; </span><span style="color: #606F73;">A project that contains other tasks</span>
             <span style="color: #53df83;">"VIDEO(v)"</span>          <span style="color: #606F73;">; </span><span style="color: #606F73;">Video assignments</span>
             <span style="color: #53df83;">"WAIT(w)"</span>           <span style="color: #606F73;">; </span><span style="color: #606F73;">Something is holding up this task</span>
             <span style="color: #53df83;">"|"</span>                 <span style="color: #606F73;">; </span><span style="color: #606F73;">The pipe necessary to separate "active" states and "inactive" states</span>
             <span style="color: #53df83;">"DONE(d)"</span>           <span style="color: #606F73;">; </span><span style="color: #606F73;">Task has been completed</span>
             <span style="color: #53df83;">"CANCELLED(c)"</span> <span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span> <span style="color: #606F73;">; </span><span style="color: #606F73;">Task has been cancelled</span>
<span style="color: #606F73;">;; </span><span style="color: #606F73;">(after! org</span>
<span style="color: #606F73;">;;   </span><span style="color: #606F73;">(custom-set-faces</span>
<span style="color: #606F73;">;;    </span><span style="color: #606F73;">;; Font sizes and colors for Org mode headers using Doom One theme colors</span>
<span style="color: #606F73;">;;    </span><span style="color: #606F73;">'(org-level-1 ((t (:height 1.4 :foreground "#51afef"))))</span>
<span style="color: #606F73;">;;    </span><span style="color: #606F73;">'(org-level-2 ((t (:height 1.3 :foreground "#c678dd"))))</span>
<span style="color: #606F73;">;;    </span><span style="color: #606F73;">'(org-level-3 ((t (:height 1.2 :foreground "#a9a1e1"))))</span>
<span style="color: #606F73;">;;    </span><span style="color: #606F73;">'(org-level-4 ((t (:height 1.0 :foreground "#7cc3f3"))))</span>
<span style="color: #606F73;">;;    </span><span style="color: #606F73;">'(org-level-5 ((t (:height 1.0 :foreground "#d499e5"))))</span>
<span style="color: #606F73;">;;    </span><span style="color: #606F73;">'(org-level-6 ((t (:height 1.9 :foreground "#a8d7f7"))))</span>
<span style="color: #606F73;">;;    </span><span style="color: #606F73;">'(org-level-7 ((t (:height 1.9 :foreground "#e2bbee"))))</span>
<span style="color: #606F73;">;;    </span><span style="color: #606F73;">'(org-level-8 ((t (:height 1.9 :foreground "#dceffb"))))</span>
<span style="color: #606F73;">;;    </span><span style="color: #606F73;">;; Add more levels and colors as needed</span>
<span style="color: #606F73;">;;    </span><span style="color: #606F73;">))</span>
 <span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">org-emphasis-alist</span>
  <span style="color: #e74c3c;">'</span><span style="color: #53df83;">(</span><span style="color: #1abc9c;">(</span><span style="color: #53df83;">"*"</span> <span style="color: #53df83;">(</span>bold <span style="color: #1abc9c;">:slant</span> italic <span style="color: #1abc9c;">:weight</span> black <span style="color: #1abc9c;">:foreground</span> <span style="color: #53df83;">"#1ABC9C"</span> <span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span> <span style="color: #606F73;">; </span><span style="color: #606F73;">blue-green</span>
    <span style="color: #1abc9c;">(</span><span style="color: #53df83;">"/"</span> <span style="color: #53df83;">(</span>italic <span style="color: #1abc9c;">:foreground</span> <span style="color: #53df83;">"#F3CA40"</span> <span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span>
    <span style="color: #1abc9c;">(</span><span style="color: #53df83;">"_"</span> <span style="color: #53df83;">(</span><span style="color: #1abc9c;">:underline</span> t  <span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span> <span style="color: #606F73;">; </span><span style="color: #606F73;">light green</span>
    <span style="color: #1abc9c;">(</span><span style="color: #53df83;">"="</span> <span style="color: #53df83;">(</span><span style="color: #1abc9c;">:foreground</span> <span style="color: #53df83;">"#E74C3C"</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span> <span style="color: #606F73;">;</span><span style="color: #606F73;">red</span>
    <span style="color: #1abc9c;">(</span><span style="color: #53df83;">"~"</span> <span style="color: #53df83;">(</span><span style="color: #1abc9c;">:foreground</span> <span style="color: #53df83;">"#53df83"</span> <span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span> <span style="color: #606F73;">; </span><span style="color: #606F73;">lime green</span>
    <span style="color: #1abc9c;">(</span><span style="color: #53df83;">"+"</span> <span style="color: #53df83;">(</span><span style="color: #1abc9c;">:strike-through</span> t <span style="color: #1abc9c;">:foreground</span> <span style="color: #53df83;">"#FFC300"</span> <span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span> <span style="color: #606F73;">;</span><span style="color: #606F73;">orange</span>

<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">after!</span> org
  <span style="color: #53df83;">(</span><span style="color: #e74c3c;">custom-set-faces</span>
   <span style="color: #606F73;">;; </span><span style="color: #606F73;">Font sizes and colors for Org mode headers using Doom One theme colors</span>
   <span style="color: #e74c3c;">'</span><span style="color: #1abc9c;">(</span>org-level-1 <span style="color: #53df83;">(</span><span style="color: #e74c3c;">(</span>t <span style="color: #53df83;">(</span><span style="color: #1abc9c;">:height</span> <span style="color: #56b5c2;">1.4</span>  <span style="color: #1abc9c;">:inherit</span> outline-1 ultra-bold<span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span>
   <span style="color: #e74c3c;">'</span><span style="color: #1abc9c;">(</span>org-level-2 <span style="color: #53df83;">(</span><span style="color: #e74c3c;">(</span>t <span style="color: #53df83;">(</span><span style="color: #1abc9c;">:height</span> <span style="color: #56b5c2;">1.3</span>  <span style="color: #1abc9c;">:inherit</span> outline-2 extra-bold<span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span>
   <span style="color: #e74c3c;">'</span><span style="color: #1abc9c;">(</span>org-level-3 <span style="color: #53df83;">(</span><span style="color: #e74c3c;">(</span>t <span style="color: #53df83;">(</span><span style="color: #1abc9c;">:height</span> <span style="color: #56b5c2;">1.2</span>  <span style="color: #1abc9c;">:inherit</span> outline-3 bold<span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span>
   <span style="color: #e74c3c;">'</span><span style="color: #1abc9c;">(</span>org-level-4 <span style="color: #53df83;">(</span><span style="color: #e74c3c;">(</span>t <span style="color: #53df83;">(</span><span style="color: #1abc9c;">:height</span> <span style="color: #56b5c2;">1.0</span>  <span style="color: #1abc9c;">:inherit</span> outline-4 semi-bold<span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span>
   <span style="color: #e74c3c;">'</span><span style="color: #1abc9c;">(</span>org-level-5 <span style="color: #53df83;">(</span><span style="color: #e74c3c;">(</span>t <span style="color: #53df83;">(</span><span style="color: #1abc9c;">:height</span> <span style="color: #56b5c2;">1.0</span>  <span style="color: #1abc9c;">:inherit</span> outline-5 normal<span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span>
   <span style="color: #e74c3c;">'</span><span style="color: #1abc9c;">(</span>org-level-6 <span style="color: #53df83;">(</span><span style="color: #e74c3c;">(</span>t <span style="color: #53df83;">(</span><span style="color: #1abc9c;">:height</span> <span style="color: #56b5c2;">0.9</span>  <span style="color: #1abc9c;">:inherit</span> outline-6 normal<span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span>
   <span style="color: #e74c3c;">'</span><span style="color: #1abc9c;">(</span>org-level-7 <span style="color: #53df83;">(</span><span style="color: #e74c3c;">(</span>t <span style="color: #53df83;">(</span><span style="color: #1abc9c;">:height</span> <span style="color: #56b5c2;">0.9</span>  <span style="color: #1abc9c;">:inherit</span> outline-7 normal<span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span>
   <span style="color: #e74c3c;">'</span><span style="color: #1abc9c;">(</span>org-level-8 <span style="color: #53df83;">(</span><span style="color: #e74c3c;">(</span>t <span style="color: #53df83;">(</span><span style="color: #1abc9c;">:height</span> <span style="color: #56b5c2;">0.9</span>  <span style="color: #1abc9c;">:inherit</span> outline-8 normal<span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span>
   <span style="color: #606F73;">;; </span><span style="color: #606F73;">Add more levels and colors as needed</span>
   <span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>
        <span style="color: #606F73;">;; </span><span style="color: #606F73;">Define function to set Doom One colors for Org mode headers</span>
  <span style="color: #606F73;">;; </span><span style="color: #606F73;">"Search org-roam directory using consult-ripgrep. With live-preview."</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">defun</span> <span style="color: #e74c3c;">org-search</span> <span style="color: #53df83;">()</span>
  <span style="color: #606F73;">"Search org-files directory using consult-ripgrep. With live-preview."</span>
  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">interactive</span><span style="color: #53df83;">)</span>
  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">let</span> <span style="color: #1abc9c;">(</span><span style="color: #53df83;">(</span><span style="color: #f8f8f0;">consult-ripgrep-args</span> <span style="color: #53df83;">"rg --null --ignore-case --type org --line-buffered --color=never --max-columns=500 --no-heading --line-number"</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">consult-ripgrep</span> <span style="color: #f8f8f0;">org-directory</span><span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>

<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">after!</span> org
  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">map!</span> <span style="color: #1abc9c;">:leader</span>
        <span style="color: #1abc9c;">(</span><span style="color: #1abc9c;">:prefix</span> <span style="color: #53df83;">(</span><span style="color: #53df83;">"n"</span> . <span style="color: #53df83;">"notes"</span><span style="color: #53df83;">)</span>
          <span style="color: #1abc9c;">:desc</span> <span style="color: #53df83;">"Org-grep/search"</span> <span style="color: #53df83;">"g "</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">org-search</span><span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>

<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">defun</span> <span style="color: #e74c3c;">org-roam-search</span> <span style="color: #53df83;">()</span>
  <span style="color: #606F73;">"Search org-roam directory using consult-ripgrep. With live-preview."</span>
  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">interactive</span><span style="color: #53df83;">)</span>
  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">let</span> <span style="color: #1abc9c;">(</span><span style="color: #53df83;">(</span><span style="color: #f8f8f0;">consult-ripgrep-args</span> <span style="color: #53df83;">"rg --null --ignore-case --type org --line-buffered --color=never --max-columns=500 --no-heading --line-number"</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">consult-ripgrep</span> <span style="color: #f8f8f0;">org-roam-directory</span><span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">Key binding setup</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">after!</span> org-roam
  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">map!</span> <span style="color: #1abc9c;">:leader</span>
        <span style="color: #1abc9c;">(</span><span style="color: #1abc9c;">:prefix</span> <span style="color: #53df83;">(</span><span style="color: #53df83;">"n"</span> . <span style="color: #53df83;">"notes"</span><span style="color: #53df83;">)</span>
          <span style="color: #1abc9c;">:desc</span> <span style="color: #53df83;">"Org-roam search"</span> <span style="color: #53df83;">"r S"</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">org-roam-search</span><span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
