emacs-notes/.config/doom/config.org
*** Make Numbered Lists
#+begin_src elisp
  (defun org-make-olist (arg)
    (interactive "P")
    (let ((n (or arg 1)))
      (when (region-active-p)
        (setq n (count-lines (region-beginning)
                             (region-end)))
        (goto-char (region-beginning)))
      (dotimes (i n)
        (beginning-of-line)
        (insert (concat (number-to-string (1+ i)) ". "))
        (forward-line))))
(map! :leader
      :desc "Create a Numbered List"
      "C-|" #'org-make-olist )
#+end_src
** org-superstar-mode / olivetti-mode
#+begin_src elisp
(add-hook 'org-mode-hook 'org-superstar-mode)
 (add-hook 'org-mode-hook 'olivetti-mode)
 (setq olivetti-body-width 100)

(require 'org-superstar)
(add-hook 'org-mode-hook (lambda () (org-superstar-mode 1)))

;; This is usually the default, but keep in mind it must be nil
(setq org-hide-leading-stars nil)
;; This line is necessary.
(setq org-superstar-leading-bullet ?\s)
;; If you use Org Indent you also need to add this, otherwise the
;; above has no effect while Indent is enabled.
(setq org-indent-mode-turns-on-hiding-stars nil)

;; off list
(setq org-superstar-item-bullet-alist nil)
;; (setq org-superstar-item-bullet-alist
;;       '((?* . ?•)  ;; * becomes •
;;         (?+ . ?➤)  ;; + becomes ➤
;;         (?- . ?–))) ;; - becomes –

;; (setq org-superstar-headline-bullets-list '("◉" "●" "○" "◆" "●" "○"))
;; (setq org-superstar-headline-bullets-list '(" " " " "-" "·" "-" "·"))
#+end_src
** org-modern-mode
#+begin_src elisp
;; Option 1: Per buffer
(add-hook 'org-mode-hook #'org-modern-mode)
(add-hook 'org-agenda-finalize-hook #'org-modern-agenda)

;; off bullets from org-modern-mode
(setq org-modern-star 'replace)

;; off all bullets
;; (setq org-modern-hide-stars 't)  ;; Hide all stars

;; (setq org-modern-priority nil)

;; off list
(setq org-modern-list nil)

;; Option 2: Globally
;; (with-eval-after-load 'org (global-org-modern-mode))
#+end_src

* Org-preview-html-mode
#+begin_src elisp
(require 'org-preview-html)
#+end_src
+ usage
  Open an Org file and execute =M-x org-preview-html-mode.= A preview window opens next to the Org file. If you want to manage this window separate (aka, make it a frame) use the function =org-preview-html-pop-window-to-frame.=
