emacs-notes/.config/doom/config.html
<div id="outline-container-orgb08d411" class="outline-4">
<h4 id="orgb08d411"><span class="section-number-4">2.0.1.</span> Make Numbered Lists</h4>
<div class="outline-text-4" id="text-2-0-1">
<div class="org-src-container">
<pre class="src src-elisp">  <span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">defun</span> <span style="color: #e74c3c;">org-make-olist</span> <span style="color: #53df83;">(</span>arg<span style="color: #53df83;">)</span>
    <span style="color: #53df83;">(</span><span style="color: #1abc9c;">interactive</span> <span style="color: #53df83;">"P"</span><span style="color: #53df83;">)</span>
    <span style="color: #53df83;">(</span><span style="color: #1abc9c;">let</span> <span style="color: #1abc9c;">(</span><span style="color: #53df83;">(</span>n <span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">or</span> arg <span style="color: #56b5c2;">1</span><span style="color: #e74c3c;">)</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span>
      <span style="color: #1abc9c;">(</span><span style="color: #1abc9c;">when</span> <span style="color: #53df83;">(</span><span style="color: #e74c3c;">region-active-p</span><span style="color: #53df83;">)</span>
        <span style="color: #53df83;">(</span><span style="color: #1abc9c;">setq</span> n <span style="color: #e74c3c;">(</span><span style="color: #e74c3c;">count-lines</span> <span style="color: #53df83;">(</span><span style="color: #1abc9c;">region-beginning</span><span style="color: #53df83;">)</span>
                             <span style="color: #53df83;">(</span><span style="color: #1abc9c;">region-end</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span><span style="color: #53df83;">)</span>
        <span style="color: #53df83;">(</span><span style="color: #1abc9c;">goto-char</span> <span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">region-beginning</span><span style="color: #e74c3c;">)</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span>
      <span style="color: #1abc9c;">(</span><span style="color: #1abc9c;">dotimes</span> <span style="color: #53df83;">(</span>i n<span style="color: #53df83;">)</span>
        <span style="color: #53df83;">(</span><span style="color: #1abc9c;">beginning-of-line</span><span style="color: #53df83;">)</span>
        <span style="color: #53df83;">(</span><span style="color: #1abc9c;">insert</span> <span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">concat</span> <span style="color: #53df83;">(</span><span style="color: #1abc9c;">number-to-string</span> <span style="color: #1abc9c;">(</span><span style="color: #1abc9c;">1+</span> i<span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span> <span style="color: #53df83;">". "</span><span style="color: #e74c3c;">)</span><span style="color: #53df83;">)</span>
        <span style="color: #53df83;">(</span><span style="color: #1abc9c;">forward-line</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">map!</span> <span style="color: #1abc9c;">:leader</span>
      <span style="color: #1abc9c;">:desc</span> <span style="color: #53df83;">"Create a Numbered List"</span>
      <span style="color: #53df83;">"C-|"</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">org-make-olist</span> <span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge0638a8" class="outline-3">
<h3 id="orge0638a8"><span class="section-number-3">2.1.</span> org-superstar-mode / olivetti-mode</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #e74c3c;">(</span><span style="color: #e74c3c;">add-hook</span> <span style="color: #e74c3c;">'</span><span style="color: #f8f8f0;">org-mode-hook</span> <span style="color: #e74c3c;">'</span><span style="color: #f8f8f0;">org-superstar-mode</span><span style="color: #e74c3c;">)</span>
 <span style="color: #e74c3c;">(</span><span style="color: #e74c3c;">add-hook</span> <span style="color: #e74c3c;">'</span><span style="color: #f8f8f0;">org-mode-hook</span> <span style="color: #e74c3c;">'</span><span style="color: #f8f8f0;">olivetti-mode</span><span style="color: #e74c3c;">)</span>
 <span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">olivetti-body-width</span> <span style="color: #56b5c2;">100</span><span style="color: #e74c3c;">)</span>

<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">require</span> <span style="color: #e74c3c;">'</span><span style="color: #1abc9c;">org-superstar</span><span style="color: #e74c3c;">)</span>
<span style="color: #e74c3c;">(</span><span style="color: #e74c3c;">add-hook</span> <span style="color: #e74c3c;">'</span><span style="color: #f8f8f0;">org-mode-hook</span> <span style="color: #53df83;">(</span><span style="color: #1abc9c;">lambda</span> <span style="color: #1abc9c;">()</span> <span style="color: #1abc9c;">(</span><span style="color: #f8f8f0;">org-superstar-mode</span> <span style="color: #56b5c2;">1</span><span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">This is usually the default, but keep in mind it must be nil</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">org-hide-leading-stars</span> nil<span style="color: #e74c3c;">)</span>
<span style="color: #606F73;">;; </span><span style="color: #606F73;">This line is necessary.</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">org-superstar-leading-bullet</span> ?\s<span style="color: #e74c3c;">)</span>
<span style="color: #606F73;">;; </span><span style="color: #606F73;">If you use Org Indent you also need to add this, otherwise the</span>
<span style="color: #606F73;">;; </span><span style="color: #606F73;">above has no effect while Indent is enabled.</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">org-indent-mode-turns-on-hiding-stars</span> nil<span style="color: #e74c3c;">)</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">off list</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">org-superstar-item-bullet-alist</span> nil<span style="color: #e74c3c;">)</span>
<span style="color: #606F73;">;; </span><span style="color: #606F73;">(setq org-superstar-item-bullet-alist</span>
<span style="color: #606F73;">;;       </span><span style="color: #606F73;">'((?* . ?&#8226;)  ;; * becomes &#8226;</span>
<span style="color: #606F73;">;;         </span><span style="color: #606F73;">(?+ . ?&#10148;)  ;; + becomes &#10148;</span>
<span style="color: #606F73;">;;         </span><span style="color: #606F73;">(?- . ?&#8211;))) ;; - becomes &#8211;</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">(setq org-superstar-headline-bullets-list '("&#9673;" "&#9679;" "&#9675;" "&#9670;" "&#9679;" "&#9675;"))</span>
<span style="color: #606F73;">;; </span><span style="color: #606F73;">(setq org-superstar-headline-bullets-list '(" " " " "-" "&#183;" "-" "&#183;"))</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org41168ec" class="outline-3">
<h3 id="org41168ec"><span class="section-number-3">2.2.</span> org-modern-mode</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #606F73;">;; </span><span style="color: #606F73;">Option 1: Per buffer</span>
<span style="color: #e74c3c;">(</span><span style="color: #e74c3c;">add-hook</span> <span style="color: #e74c3c;">'</span><span style="color: #f8f8f0;">org-mode-hook</span> <span style="color: #e74c3c;">#'</span><span style="color: #f8f8f0;">org-modern-mode</span><span style="color: #e74c3c;">)</span>
<span style="color: #e74c3c;">(</span><span style="color: #e74c3c;">add-hook</span> <span style="color: #e74c3c;">'</span><span style="color: #f8f8f0;">org-agenda-finalize-hook</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">org-modern-agenda</span><span style="color: #e74c3c;">)</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">off bullets from org-modern-mode</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">org-modern-star</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">replace</span><span style="color: #e74c3c;">)</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">off all bullets</span>
<span style="color: #606F73;">;; </span><span style="color: #606F73;">(setq org-modern-hide-stars 't)  ;; Hide all stars</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">(setq org-modern-priority nil)</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">off list</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">org-modern-list</span> nil<span style="color: #e74c3c;">)</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">Option 2: Globally</span>
<span style="color: #606F73;">;; </span><span style="color: #606F73;">(with-eval-after-load 'org (global-org-modern-mode))</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org19769c8" class="outline-2">
<h2 id="org19769c8"><span class="section-number-2">3.</span> Org-preview-html-mode</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">require</span> <span style="color: #e74c3c;">'</span><span style="color: #1abc9c;">org-preview-html</span><span style="color: #e74c3c;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>usage
Open an Org file and execute <code>M-x org-preview-html-mode.</code> A preview window opens next to the Org file. If you want to manage this window separate (aka, make it a frame) use the function <code>org-preview-html-pop-window-to-frame.</code></li>
</ul>
</div>
