emacs-notes/.config/doom/config.html
<div id="outline-container-orgb192304" class="outline-3">
<h3 id="orgb192304"><span class="section-number-3">3.1.</span> Org-auto-tangle</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<code>org-auto-tangle</code> allows you to add the option <code>#+auto_tangle: t</code> in your Org file so that it automatically tangles when you save the document.  I have made adding this to your file even easier by creating a function &rsquo;dt/insert-auto-tangle-tag&rsquo; and setting it to a keybinding &rsquo;SPC i a&rsquo;.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">use-package!</span> org-auto-tangle
  <span style="color: #1abc9c;">:defer</span> t
  <span style="color: #1abc9c;">:hook</span> <span style="color: #53df83;">(</span><span style="color: #e74c3c;">org-mode</span> . <span style="color: #f8f8f0;">org-auto-tangle-mode</span><span style="color: #53df83;">)</span>
  <span style="color: #1abc9c;">:config</span>
  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">org-auto-tangle-default</span> t<span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>

<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">defun</span> <span style="color: #e74c3c;">dt/insert-auto-tangle-tag</span> <span style="color: #53df83;">()</span>
  <span style="color: #606F73;">"Insert auto-tangle tag in a literate config."</span>
  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">interactive</span><span style="color: #53df83;">)</span>
  <span style="color: #53df83;">(</span><span style="color: #e74c3c;">evil-org-open-below</span> <span style="color: #56b5c2;">1</span><span style="color: #53df83;">)</span>
  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">insert</span> <span style="color: #53df83;">"#+auto_tangle: t "</span><span style="color: #53df83;">)</span>
  <span style="color: #53df83;">(</span><span style="color: #e74c3c;">evil-force-normal-state</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>

<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">map!</span> <span style="color: #1abc9c;">:leader</span>
      <span style="color: #1abc9c;">:desc</span> <span style="color: #53df83;">"Insert auto_tangle tag"</span> <span style="color: #53df83;">"i a"</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">dt/insert-auto-tangle-tag</span><span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
</div>
