emacs-notes/.config/doom/config.org
** org roam
#+begin_src elisp
(after! org-roam
  (setq org-roam-directory "~/roam/")
  (setq org-roam-completion-everywhere t)
  ;; (setq org-roam-graph-viewer "~/usr/bin/brave")
  ;; Additional keybinding in org-mode-map
  (map! :map org-mode-map
        ;; Use `C-M-i` for completion-at-point
        "C-M-i" #'completion-at-point)
  ;; Enable org-roam
  (org-roam-db-autosync-enable))

(use-package! websocket
  :after org-roam)

(use-package! org-roam-ui
  :after org-roam ;; or :after org
  ;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
  ;;         a hookable mode anymore, you're advised to pick something yourself
  ;;         if you don't care about startup time, use
  ;;  :hook (after-init . org-roam-ui-mode)
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t))

;; Bind this to SPC n r I
(defun my/org-roam-node-insert-immediate (arg &rest args)
  (interactive "P")
  (let ((args (cons arg args))
        (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                  '(:immediate-finish t)))))
    (apply #'org-roam-node-insert args)))

(map! :leader
      :prefix ("n" . "notes")
      :desc "Insert org-roam node" "r I" #'my/org-roam-node-insert-immediate)

;; Removing timestamp from filename
(after! org-roam
  (setq org-roam-capture-templates
        '(("d" "default" plain "%?"
           :target (file+head "${slug}.org"
                              "#+title: ${title}\n")
           :unnarrowed t))))

(defun my/org-roam-list-tags ()
  "List all unique tags from Org Roam notes in a separate buffer."
  (interactive)
  (if (not (bound-and-true-p org-roam-directory))
      (error "Org Roam directory is not set.")
    (let ((tags '()))
      ;; Collect tags from Org Roam notes
      (dolist (file (directory-files-recursively org-roam-directory "\\.org$"))
        (with-temp-buffer
          (insert-file-contents file)
          (org-mode)
          (org-element-map (org-element-parse-buffer) 'headline
            (lambda (headline)
              (let ((headline-tags (org-element-property :tags headline)))
                (setq tags (append tags headline-tags)))))))

      ;; Remove duplicates and sort tags
      (setq tags (delete-dups tags))
      (setq tags (sort tags 'string<))

      ;; Create and populate a new buffer with the tags
      (let ((buf (get-buffer-create "*Org Roam Tags*")))
        (with-current-buffer buf
          (erase-buffer)
          (insert "Tags:\n")
          (dolist (tag tags)
            (insert (format "%s\n" tag)))
          (goto-char (point-min)))
        (display-buffer buf)))))

;; roam-tags
(defun my/org-roam-tags-search (&optional todo-only match)
  "Show all headlines for files in `org-roam-directory` matching a TAGS criterion.
The prefix arg TODO-ONLY limits the search to TODO entries."
  (interactive "P")
  (when org-agenda-overriding-arguments
    (setq todo-only (car org-agenda-overriding-arguments)
          match (nth 1 org-agenda-overriding-arguments)))
  (let* ((org-tags-match-list-sublevels
          org-tags-match-list-sublevels)
         (completion-ignore-case t)
         (org--matcher-tags-todo-only todo-only)
         rtn rtnall files file pos matcher
         buffer)
    (when (and (stringp match) (not (string-match "\\S-" match)))
      (setq match nil))
    (catch 'exit
      (setq org-agenda-buffer-name
            (org-agenda--get-buffer-name
             (and org-agenda-sticky
                  (if (stringp match)
                      (format "*Org Agenda(%s:%s)*"
                              (or org-keys (or (and todo-only "M") "m"))
                              match)
                    (format "*Org Agenda(%s)*"
                            (or (and todo-only "M") "m"))))))
      (setq matcher (org-make-tags-matcher match))
      ;; Prepare agendas (and `org-tag-alist-for-agenda') before
      ;; expanding tags within `org-make-tags-matcher'
      (org-agenda-prepare (concat "TAGS " match))
      (setq match (car matcher)
            matcher (cdr matcher))
      (org-compile-prefix-format 'tags)
      (org-set-sorting-strategy 'tags)
      (setq org-agenda-query-string match)
      (setq org-agenda-redo-command
            (list 'roam-tags-view
                  `(quote ,org--matcher-tags-todo-only)
                  `(if current-prefix-arg nil ,org-agenda-query-string)))
      ;; Get files from `org-roam-directory`
      (setq files (directory-files-recursively org-roam-directory "\\.org\\'") ;; Find all .org files
            rtnall nil)
      (while (setq file (pop files))
        (catch 'nextfile
          (org-check-agenda-file file)
          (setq buffer (if (file-exists-p file)
                           (org-get-agenda-file-buffer file)
                         (error "No such file %s" file)))
          (if (not buffer)
              ;; If file does not exist, error message to agenda
              (setq rtn (list
                         (format "ORG-AGENDA-ERROR: No such org-file %s" file))
                    rtnall (append rtnall rtn))
            (with-current-buffer buffer
              (unless (derived-mode-p 'org-mode)
                (error "Agenda file %s is not in Org mode" file))
              (save-excursion
                (save-restriction
                  (if (eq buffer org-agenda-restrict)
                      (narrow-to-region org-agenda-restrict-begin
                                        org-agenda-restrict-end)
                    (widen))
                  (setq rtn (org-scan-tags 'agenda
                                           matcher
                                           org--matcher-tags-todo-only))
                  (setq rtnall (append rtnall rtn))))))))
      (org-agenda--insert-overriding-header
        (with-temp-buffer
          (insert "Headlines with TAGS match: ")
          (add-text-properties (point-min) (1- (point))
                               (list 'face 'org-agenda-structure
                                     'short-heading
                                     (concat "Match: " match)))
          (setq pos (point))
          (insert match "\n")
          (add-text-properties pos (1- (point)) (list 'face 'org-agenda-structure-filter))
          (setq pos (point))
          (unless org-agenda-multi
            (insert (substitute-command-keys
                     "Press \
\\<org-agenda-mode-map>`\\[universal-argument] \\[org-agenda-redo]' \
to search again\n")))
          (add-text-properties pos (1- (point))
                               (list 'face 'org-agenda-structure-secondary))
          (buffer-string)))
      (org-agenda-mark-header-line (point-min))
      (when rtnall
        (insert (org-agenda-finalize-entries rtnall 'tags) "\n"))
      (goto-char (point-min))
      (or org-agenda-multi (org-agenda-fit-window-to-buffer))
      (add-text-properties
       (point-min) (point-max)
       `(org-agenda-type tags
                         org-last-args (,org--matcher-tags-todo-only ,match)
                         org-redo-cmd ,org-agenda-redo-command
                         org-series-cmd ,org-cmd))
      (org-agenda-finalize)
      (setq buffer-read-only t))))
#+end_src
