emacs-notes/.config/doom/config.html
<div id="outline-container-org6f45dfb" class="outline-3">
<h3 id="org6f45dfb"><span class="section-number-3">3.2.</span> org roam</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">after!</span> org-roam
  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">org-roam-directory</span> <span style="color: #53df83;">"~/roam/"</span><span style="color: #53df83;">)</span>
  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">org-roam-completion-everywhere</span> t<span style="color: #53df83;">)</span>
  <span style="color: #606F73;">;; </span><span style="color: #606F73;">(setq org-roam-graph-viewer "~/usr/bin/brave")</span>
  <span style="color: #606F73;">;; </span><span style="color: #606F73;">Additional keybinding in org-mode-map</span>
  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">map!</span> <span style="color: #1abc9c;">:map</span> <span style="color: #f8f8f0;">org-mode-map</span>
        <span style="color: #606F73;">;; </span><span style="color: #606F73;">Use `C-M-i` for completion-at-point</span>
        <span style="color: #53df83;">"C-M-i"</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">completion-at-point</span><span style="color: #53df83;">)</span>
  <span style="color: #606F73;">;; </span><span style="color: #606F73;">Enable org-roam</span>
  <span style="color: #53df83;">(</span><span style="color: #e74c3c;">org-roam-db-autosync-enable</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>

<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">use-package!</span> websocket
  <span style="color: #1abc9c;">:after</span> org-roam<span style="color: #e74c3c;">)</span>

<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">use-package!</span> org-roam-ui
  <span style="color: #1abc9c;">:after</span> org-roam <span style="color: #606F73;">;; </span><span style="color: #606F73;">or :after org</span>
  <span style="color: #606F73;">;;         </span><span style="color: #606F73;">normally we'd recommend hooking orui after org-roam, but since org-roam does not have</span>
  <span style="color: #606F73;">;;         </span><span style="color: #606F73;">a hookable mode anymore, you're advised to pick something yourself</span>
  <span style="color: #606F73;">;;         </span><span style="color: #606F73;">if you don't care about startup time, use</span>
  <span style="color: #606F73;">;;  </span><span style="color: #606F73;">:hook (after-init . org-roam-ui-mode)</span>
  <span style="color: #1abc9c;">:config</span>
  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">org-roam-ui-sync-theme</span> t
        <span style="color: #f8f8f0;">org-roam-ui-follow</span> t
        <span style="color: #f8f8f0;">org-roam-ui-update-on-save</span> t
        <span style="color: #f8f8f0;">org-roam-ui-open-on-start</span> t<span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">Bind this to SPC n r I</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">defun</span> <span style="color: #e74c3c;">org-roam-node-insert-immediate</span> <span style="color: #53df83;">(</span>arg <span style="color: #e74c3c;">&amp;rest</span> args<span style="color: #53df83;">)</span>
  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">interactive</span> <span style="color: #53df83;">"P"</span><span style="color: #53df83;">)</span>
  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">let</span> <span style="color: #1abc9c;">(</span><span style="color: #53df83;">(</span>args <span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">cons</span> arg args<span style="color: #e74c3c;">)</span><span style="color: #53df83;">)</span>
        <span style="color: #53df83;">(</span><span style="color: #f8f8f0;">org-roam-capture-templates</span> <span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">list</span> <span style="color: #53df83;">(</span><span style="color: #1abc9c;">append</span> <span style="color: #1abc9c;">(</span><span style="color: #1abc9c;">car</span> <span style="color: #f8f8f0;">org-roam-capture-templates</span><span style="color: #1abc9c;">)</span>
                                                  <span style="color: #e74c3c;">'</span><span style="color: #1abc9c;">(</span><span style="color: #1abc9c;">:immediate-finish</span> t<span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span>
    <span style="color: #1abc9c;">(</span><span style="color: #1abc9c;">apply</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">org-roam-node-insert</span> args<span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>

<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">map!</span> <span style="color: #1abc9c;">:leader</span>
      <span style="color: #1abc9c;">:prefix</span> <span style="color: #53df83;">(</span><span style="color: #53df83;">"n"</span> . <span style="color: #53df83;">"notes"</span><span style="color: #53df83;">)</span>
      <span style="color: #1abc9c;">:desc</span> <span style="color: #53df83;">"Insert org-roam node"</span> <span style="color: #53df83;">"r I"</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">org-roam-node-insert-immediate</span><span style="color: #e74c3c;">)</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">Removing timestamp from filename</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">after!</span> org-roam
  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">org-roam-capture-templates</span>
        <span style="color: #e74c3c;">'</span><span style="color: #1abc9c;">(</span><span style="color: #53df83;">(</span><span style="color: #53df83;">"d"</span> <span style="color: #53df83;">"default"</span> plain <span style="color: #53df83;">"%?"</span>
           <span style="color: #1abc9c;">:target</span> <span style="color: #e74c3c;">(</span>file+head <span style="color: #53df83;">"${slug}.org"</span>
                              <span style="color: #53df83;">"#+title: ${title}\n"</span><span style="color: #e74c3c;">)</span>
           <span style="color: #1abc9c;">:unnarrowed</span> t<span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
</div>
