emacs-notes/.config/doom/config.html
<div id="outline-container-org026638d" class="outline-3">
<h3 id="org026638d"><span class="section-number-3">3.3.</span> org agenda</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">after!</span> org
  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">org-agenda-files</span>
  <span style="color: #e74c3c;">'</span><span style="color: #1abc9c;">(</span><span style="color: #53df83;">"~/roam/org/agenda.org"</span><span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>

<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">after!</span> org-agenda
<span style="color: #53df83;">(</span><span style="color: #1abc9c;">setq</span>
   <span style="color: #606F73;">;; </span><span style="color: #606F73;">org-fancy-priorities-list '("[A]" "[B]" "[C]")</span>
   <span style="color: #606F73;">;; </span><span style="color: #606F73;">org-fancy-priorities-list '("&#10071;" "[B]" "[C]")</span>
   <span style="color: #606F73;">;; </span><span style="color: #606F73;">org-fancy-priorities-list '("&#128308;" "&#128993;" "&#128994;")</span>
   <span style="color: #606F73;">;; </span><span style="color: #606F73;">org-fancy-priorities-list '("&#128308;" "&#128309;" "&#128994;")</span>
   <span style="color: #606F73;">;; </span><span style="color: #606F73;">org-fancy-priorities-list '("&#128997;" "&#128999;" "&#129000;")</span>
   <span style="color: #f8f8f0;">org-priority-faces</span>
   <span style="color: #e74c3c;">'</span><span style="color: #1abc9c;">(</span><span style="color: #53df83;">(</span>?A <span style="color: #1abc9c;">:foreground</span> <span style="color: #53df83;">"#ff6c6b"</span> <span style="color: #1abc9c;">:weight</span> bold<span style="color: #53df83;">)</span>
     <span style="color: #53df83;">(</span>?B <span style="color: #1abc9c;">:foreground</span> <span style="color: #53df83;">"#98be65"</span> <span style="color: #1abc9c;">:weight</span> bold<span style="color: #53df83;">)</span>
     <span style="color: #53df83;">(</span>?C <span style="color: #1abc9c;">:foreground</span> <span style="color: #53df83;">"#c678dd"</span> <span style="color: #1abc9c;">:weight</span> bold<span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span>
   <span style="color: #f8f8f0;">org-agenda-block-separator</span> <span style="color: #56b5c2;">8411</span><span style="color: #53df83;">)</span>

<span style="color: #53df83;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">org-agenda-custom-commands</span>
      <span style="color: #e74c3c;">'</span><span style="color: #1abc9c;">(</span><span style="color: #53df83;">(</span><span style="color: #53df83;">"v"</span> <span style="color: #53df83;">"A better agenda view"</span>
         <span style="color: #e74c3c;">(</span><span style="color: #53df83;">(</span>tags <span style="color: #53df83;">"PRIORITY=\"A\""</span>
                <span style="color: #1abc9c;">(</span><span style="color: #53df83;">(</span><span style="color: #f8f8f0;">org-agenda-skip-function</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">(</span>org-agenda-skip-entry-if <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">todo</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">done</span><span style="color: #e74c3c;">)</span><span style="color: #53df83;">)</span>
                 <span style="color: #53df83;">(</span><span style="color: #f8f8f0;">org-agenda-overriding-header</span> <span style="color: #53df83;">"High-priority unfinished tasks:"</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span>
          <span style="color: #53df83;">(</span>tags <span style="color: #53df83;">"PRIORITY=\"B\""</span>
                <span style="color: #1abc9c;">(</span><span style="color: #53df83;">(</span><span style="color: #f8f8f0;">org-agenda-skip-function</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">(</span>org-agenda-skip-entry-if <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">todo</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">done</span><span style="color: #e74c3c;">)</span><span style="color: #53df83;">)</span>
                 <span style="color: #53df83;">(</span><span style="color: #f8f8f0;">org-agenda-overriding-header</span> <span style="color: #53df83;">"Medium-priority unfinished tasks:"</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span>
          <span style="color: #53df83;">(</span>tags <span style="color: #53df83;">"PRIORITY=\"C\""</span>
                <span style="color: #1abc9c;">(</span><span style="color: #53df83;">(</span><span style="color: #f8f8f0;">org-agenda-skip-function</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">(</span>org-agenda-skip-entry-if <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">todo</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">done</span><span style="color: #e74c3c;">)</span><span style="color: #53df83;">)</span>
                 <span style="color: #53df83;">(</span><span style="color: #f8f8f0;">org-agenda-overriding-header</span> <span style="color: #53df83;">"Low-priority unfinished tasks:"</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span>
          <span style="color: #53df83;">(</span>tags <span style="color: #53df83;">"customtag"</span>
                <span style="color: #1abc9c;">(</span><span style="color: #53df83;">(</span><span style="color: #f8f8f0;">org-agenda-skip-function</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">(</span>org-agenda-skip-entry-if <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">todo</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">done</span><span style="color: #e74c3c;">)</span><span style="color: #53df83;">)</span>
                 <span style="color: #53df83;">(</span><span style="color: #f8f8f0;">org-agenda-overriding-header</span> <span style="color: #53df83;">"Tasks marked with customtag:"</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span>

          <span style="color: #53df83;">(</span>agenda <span style="color: #53df83;">""</span><span style="color: #53df83;">)</span>
          <span style="color: #53df83;">(</span>alltodo <span style="color: #53df83;">""</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd8bfb8b" class="outline-3">
<h3 id="orgd8bfb8b"><span class="section-number-3">3.4.</span> org download</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">after!</span> org-download
<span style="color: #53df83;">(</span><span style="color: #1abc9c;">setq</span> org-download-image-dir <span style="color: #53df83;">"~/roam/img/"</span><span style="color: #53df83;">)</span>
<span style="color: #53df83;">(</span><span style="color: #1abc9c;">setq-default</span> org-download-image-dir <span style="color: #53df83;">"~/roam/img/"</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">after!</span> org
<span style="color: #53df83;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">org-attach-directory</span> <span style="color: #53df83;">"~/roam/img/"</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2fa5149" class="outline-3">
<h3 id="org2fa5149"><span class="section-number-3">3.5.</span> deft</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">after!</span> deft
<span style="color: #53df83;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">deft-directory</span> <span style="color: #53df83;">"~/roam/"</span>
<span style="color: #606F73;">;; </span><span style="color: #606F73;">(setq deft-directory "~/notes/"</span>
      deft-extension <span style="color: #e74c3c;">'</span><span style="color: #1abc9c;">(</span><span style="color: #53df83;">"txt"</span> <span style="color: #53df83;">"org"</span> <span style="color: #53df83;">"md"</span><span style="color: #1abc9c;">)</span>
      <span style="color: #606F73;">;; </span><span style="color: #606F73;">deft-strip-summary-regexp "\\([\n ]\\|^#\\+[[:upper:][:lower:]_]+:.*$\\)"</span>
      <span style="color: #606F73;">;; </span><span style="color: #606F73;">deft-strip-summary-regexp ":PROPERTIES:\n\\(.+\n\\)+:END:\n"</span>
      <span style="color: #f8f8f0;">deft-use-filename-as-title</span> t
      <span style="color: #f8f8f0;">deft-recursive</span> t<span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
</div>
