emacs-notes/.config/doom/config.html
<div id="outline-container-org1ca3cd9" class="outline-3">
<h3 id="org1ca3cd9"><span class="section-number-3">3.6.</span> dired</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #606F73;">;; </span><span style="color: #606F73;">dired</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">map!</span> <span style="color: #1abc9c;">:leader</span>
      <span style="color: #53df83;">(</span><span style="color: #1abc9c;">:prefix</span> <span style="color: #1abc9c;">(</span><span style="color: #53df83;">"d"</span> . <span style="color: #53df83;">"dired"</span><span style="color: #1abc9c;">)</span>
       <span style="color: #1abc9c;">:desc</span> <span style="color: #53df83;">"Open dired"</span> <span style="color: #53df83;">"d"</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">dired</span>
       <span style="color: #1abc9c;">:desc</span> <span style="color: #53df83;">"Dired jump to current"</span> <span style="color: #53df83;">"j"</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">dired-jump</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>

<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">after!</span> dired
  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">map!</span> <span style="color: #1abc9c;">:map</span> <span style="color: #f8f8f0;">dired-mode-map</span>
        <span style="color: #1abc9c;">:desc</span> <span style="color: #53df83;">"Peep-dired image previews"</span> <span style="color: #53df83;">"d p"</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">peep-dired</span>
        <span style="color: #1abc9c;">:desc</span> <span style="color: #53df83;">"Dired view file"</span>           <span style="color: #53df83;">"d v"</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">dired-view-file</span><span style="color: #53df83;">)</span>

  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">evil-define-key</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">normal</span> <span style="color: #f8f8f0;">dired-mode-map</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"M-RET"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-display-file</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"h"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-up-directory</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"l"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-find-file</span> <span style="color: #606F73;">; </span><span style="color: #606F73;">use dired-find-file instead of dired-open.</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"m"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-mark</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"t"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-toggle-marks</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"u"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-unmark</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"C"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-do-copy</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"D"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-do-delete</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"J"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-goto-file</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"M"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-do-chmod</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"O"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-do-chown</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"P"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-do-print</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"R"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-do-rename</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"T"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-do-touch</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"Y"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-copy-filenamecopy-filename-as-kill</span> <span style="color: #606F73;">; </span><span style="color: #606F73;">copies filename to kill ring.</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"Z"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-do-compress</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"+"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-create-directory</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"-"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-do-kill-lines</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"% l"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-downcase</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"% m"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-mark-files-regexp</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"% u"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-upcase</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"* %"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-mark-files-regexp</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"* ."</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-mark-extension</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"* /"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">dired-mark-directories</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"; d"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">epa-dired-do-decrypt</span>
    <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"; e"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">epa-dired-do-encrypt</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">Get file icons in dired</span>
<span style="color: #e74c3c;">(</span><span style="color: #e74c3c;">add-hook</span> <span style="color: #e74c3c;">'</span><span style="color: #f8f8f0;">dired-mode-hook</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">nerd-icons-dired-mode</span><span style="color: #e74c3c;">)</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">With dired-open plugin, you can launch external programs for certain extensions</span>
<span style="color: #606F73;">;; </span><span style="color: #606F73;">For example, I set all .png files to open in '</span><span style="color: #1abc9c;">sxiv</span><span style="color: #606F73;">' and all .mp4 files to open in '</span><span style="color: #1abc9c;">mpv</span><span style="color: #606F73;">'</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> dired-open-extensions <span style="color: #e74c3c;">'</span><span style="color: #53df83;">(</span><span style="color: #1abc9c;">(</span><span style="color: #53df83;">"gif"</span> . <span style="color: #53df83;">"sxiv"</span><span style="color: #1abc9c;">)</span>
                              <span style="color: #1abc9c;">(</span><span style="color: #53df83;">"jpg"</span> . <span style="color: #53df83;">"sxiv"</span><span style="color: #1abc9c;">)</span>
                              <span style="color: #1abc9c;">(</span><span style="color: #53df83;">"png"</span> . <span style="color: #53df83;">"sxiv"</span><span style="color: #1abc9c;">)</span>
                              <span style="color: #1abc9c;">(</span><span style="color: #53df83;">"mkv"</span> . <span style="color: #53df83;">"mpv"</span><span style="color: #1abc9c;">)</span>
                              <span style="color: #1abc9c;">(</span><span style="color: #53df83;">"mp4"</span> . <span style="color: #53df83;">"mpv"</span><span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>

<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">defun</span> <span style="color: #e74c3c;">my-dired-view-file</span> <span style="color: #53df83;">()</span>
  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">interactive</span><span style="color: #53df83;">)</span>
  <span style="color: #53df83;">(</span><span style="color: #e74c3c;">dired-view-file</span><span style="color: #53df83;">)</span>
  <span style="color: #53df83;">(</span><span style="color: #e74c3c;">local-set-key</span> <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"&lt;f5&gt;"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">View-quit</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>

<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">after!</span> dired
  <span style="color: #53df83;">(</span><span style="color: #1abc9c;">define-key</span> <span style="color: #f8f8f0;">dired-mode-map</span> <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"&lt;f5&gt;"</span><span style="color: #1abc9c;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">my-dired-view-file</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
</div>
</div>
