emacs-notes/.config/doom/config.html
<div id="outline-container-org3fdf09e" class="outline-2">
<h2 id="org3fdf09e"><span class="section-number-2">4.</span> doom appearance</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-elisp"> <span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">global-vi-tilde-fringe-mode</span> nil <span style="color: #e74c3c;">)</span> <span style="color: #606F73;">; </span><span style="color: #606F73;">removes the tildas</span>

<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">undo-limit</span> <span style="color: #56b5c2;">80000000</span>                         <span style="color: #606F73;">; </span><span style="color: #606F73;">Raise undo-limit to 80Mb</span>
      <span style="color: #f8f8f0;">evil-want-fine-undo</span> t                       <span style="color: #606F73;">; </span><span style="color: #606F73;">By default while in insert all changes are one big blob. Be more granular</span>
      <span style="color: #f8f8f0;">auto-save-default</span> t                         <span style="color: #606F73;">; </span><span style="color: #606F73;">Nobody likes to loose work, I certainly don't</span>
      <span style="color: #f8f8f0;">inhibit-compacting-font-caches</span> t            <span style="color: #606F73;">; </span><span style="color: #606F73;">When there are lots of glyphs, keep them in memory</span>
      <span style="color: #f8f8f0;">truncate-string-ellipsis</span> <span style="color: #53df83;">"&#8230;"</span><span style="color: #e74c3c;">)</span>              <span style="color: #606F73;">; </span><span style="color: #606F73;">Unicode ellispis are nicer than "...", and also save /precious/ space</span>

<span style="color: #e74c3c;">(</span><span style="color: #f8f8f0;">display-time-mode</span> <span style="color: #56b5c2;">1</span><span style="color: #e74c3c;">)</span>                             <span style="color: #606F73;">; </span><span style="color: #606F73;">Enable time in the mode-line</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">unless</span> <span style="color: #53df83;">(</span><span style="color: #1abc9c;">equal</span> <span style="color: #53df83;">"Battery status not available"</span>
               <span style="color: #1abc9c;">(</span><span style="color: #e74c3c;">battery</span><span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span>
  <span style="color: #53df83;">(</span><span style="color: #f8f8f0;">display-battery-mode</span> <span style="color: #56b5c2;">1</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>                       <span style="color: #606F73;">; </span><span style="color: #606F73;">On laptops it's nice to know how much power you have</span>
<span style="color: #e74c3c;">(</span><span style="color: #f8f8f0;">global-subword-mode</span> <span style="color: #56b5c2;">1</span><span style="color: #e74c3c;">)</span>                           <span style="color: #606F73;">; </span><span style="color: #606F73;">Iterate through CamelCase words</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq-default</span> <span style="color: #f8f8f0;">line-spacing</span> <span style="color: #56b5c2;">5</span><span style="color: #e74c3c;">)</span>
<span style="color: #e74c3c;">(</span><span style="color: #e74c3c;">remove-hook</span> <span style="color: #e74c3c;">'</span><span style="color: #f8f8f0;">after-init-hook</span> <span style="color: #e74c3c;">#'</span><span style="color: #f8f8f0;">doom-modeline-mode</span><span style="color: #e74c3c;">)</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">org-indent-indentation-per-level</span> <span style="color: #56b5c2;">4</span><span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2918245" class="outline-2">
<h2 id="org2918245"><span class="section-number-2">5.</span> OPTIMIZING</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #606F73;">;; </span><span style="color: #606F73;">Disable org-appear-mode</span>
<span style="color: #e74c3c;">(</span><span style="color: #e74c3c;">add-hook</span> <span style="color: #e74c3c;">'</span><span style="color: #f8f8f0;">org-mode-hook</span> <span style="color: #e74c3c;">#'</span><span style="color: #f8f8f0;">org-appear-mode</span><span style="color: #e74c3c;">)</span>
<span style="color: #606F73;">;; </span><span style="color: #606F73;">Set a higher garbage collection threshold (e.g., 100 MB)</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">gc-cons-threshold</span> <span style="color: #53df83;">(</span><span style="color: #1abc9c;">*</span> <span style="color: #56b5c2;">100</span> <span style="color: #56b5c2;">1024</span> <span style="color: #56b5c2;">1024</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">Disable flycheck</span>
<span style="color: #606F73;">;; </span><span style="color: #606F73;">(global-flycheck-mode -1)</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">Minimize garbage collection during startup</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">gc-cons-threshold</span> <span style="color: #f8f8f0;">most-positive-fixnum</span><span style="color: #e74c3c;">)</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">Lower threshold back to 8 MiB (default is 800kB)</span>
<span style="color: #e74c3c;">(</span><span style="color: #e74c3c;">add-hook</span> <span style="color: #e74c3c;">'</span><span style="color: #f8f8f0;">emacs-startup-hook</span>
          <span style="color: #53df83;">(</span><span style="color: #1abc9c;">lambda</span> <span style="color: #1abc9c;">()</span>
            <span style="color: #1abc9c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">gc-cons-threshold</span> <span style="color: #53df83;">(</span><span style="color: #1abc9c;">expt</span> <span style="color: #56b5c2;">2</span> <span style="color: #56b5c2;">23</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>

<span style="color: #e74c3c;">(</span><span style="color: #f8f8f0;">global-font-lock-mode</span> t<span style="color: #e74c3c;">)</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">font-lock-maximum-decoration</span> t<span style="color: #e74c3c;">)</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> font-lock-maximum-size <span style="color: #56b5c2;">100000</span><span style="color: #e74c3c;">)</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">font-lock-support-mode</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">lazy-lock-mode</span><span style="color: #e74c3c;">)</span>
<span style="color: #606F73;">;; </span><span style="color: #606F73;">Whether display the buffer name.</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">doom-modeline-buffer-name</span> t<span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga08d73d" class="outline-2">
<h2 id="orga08d73d"><span class="section-number-2">6.</span> custome function</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #606F73;">;; </span><span style="color: #606F73;">Toggle Evil mode with F9</span>
<span style="color: #e74c3c;">(</span><span style="color: #e74c3c;">global-set-key</span> <span style="color: #53df83;">(</span><span style="color: #e74c3c;">kbd</span> <span style="color: #53df83;">"&lt;f9&gt;"</span><span style="color: #53df83;">)</span> <span style="color: #e74c3c;">'</span><span style="color: #f8f8f0;">evil-mode</span><span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7947b93" class="outline-2">
<h2 id="org7947b93"><span class="section-number-2">7.</span> other config</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgef39344" class="outline-3">
<h3 id="orgef39344"><span class="section-number-3">7.1.</span> Remembering the last place you visited in a file</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Sometimes its convenient for Emacs to remember the last location you were at when you visited a particular file. The save-place-mode can help with that!
</p>

<p>
Once you turn on this mode, Emacs will drop your cursor to the last visited location in any file that you open.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #606F73;">;; </span><span style="color: #606F73;">Remember and restore the last cursor location of opened files</span>
<span style="color: #e74c3c;">(</span><span style="color: #f8f8f0;">save-place-mode</span> <span style="color: #56b5c2;">1</span><span style="color: #e74c3c;">)</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-orgfa0a853" class="outline-3">
<h3 id="orgfa0a853"><span class="section-number-3">7.2.</span> Prevent using UI dialog&rsquo;s for prompts</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Emacs will show prompts to confirm many different types of actions, and for some of them it shows a graphical dialog box. If you prefer to keep your Emacs workflow more keyboard-focused, you can turn off those dialog box prompts with this setting:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #606F73;">;; </span><span style="color: #606F73;">Don't pop up UI dialogs when prompting</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">use-dialog-box</span> nil<span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
</div>
