emacs-notes/.config/doom/config.html
<div id="outline-container-orgd452e55" class="outline-3">
<h3 id="orgd452e55"><span class="section-number-3">7.3.</span> Automatically revert buffers for changed files</h3>
<div class="outline-text-3" id="text-7-3">
<p>
One thing that can be annoying about Emacs when you first start using it is that it doesnt automatically refresh file buffers when the file on disk has been changed outside of Emacs. This can often happen when youre using tools that generate some kind of text file output that you need to read in an Emacs buffer.
</p>

<p>
The global-auto-revert-mode will make Emacs watch the files for all open buffers for changes on disk and it will automatically refresh those buffers if they dont have unsaved changes!
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #606F73;">;; </span><span style="color: #606F73;">Revert buffers when the underlying file has changed</span>
<span style="color: #e74c3c;">(</span><span style="color: #f8f8f0;">global-auto-revert-mode</span> <span style="color: #56b5c2;">1</span><span style="color: #e74c3c;">)</span>
</pre>
</div>
<p>
I also like adding the following setting to cause other types of buffers in Emacs to update when related files on disk have changed.
</p>

<p>
The place this is most useful is when youre using Emacs excellent Dired package! The following setting will cause Dired buffers to be automatically refreshed when files get added or deleted from the directory you are browsing:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #606F73;">;; </span><span style="color: #606F73;">Revert Dired and other buffers</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">global-auto-revert-non-file-buffers</span> t<span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd41867e" class="outline-3">
<h3 id="orgd41867e"><span class="section-number-3">7.4.</span> On relative line numbers</h3>
<div class="outline-text-3" id="text-7-4">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #606F73;">;; </span><span style="color: #606F73;">(setq display-line-numbers-type 'relative)</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">off</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">display-line-numbers-type</span> nil<span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2dd8243" class="outline-3">
<h3 id="org2dd8243"><span class="section-number-3">7.5.</span> Set default shell in Emacs vterm</h3>
<div class="outline-text-3" id="text-7-5">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">shell-file-name</span> <span style="color: #53df83;">(</span><span style="color: #e74c3c;">executable-find</span> <span style="color: #53df83;">"fish"</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3f19eb3" class="outline-3">
<h3 id="org3f19eb3"><span class="section-number-3">7.6.</span> multi-vterm</h3>
<div class="outline-text-3" id="text-7-6">
<ul class="org-ul">
<li><a href="https://github.com/suonlight/multi-vterm">multi-vterm github</a></li>
</ul>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">use-package</span> multi-vterm <span style="color: #1abc9c;">:ensure</span> t<span style="color: #e74c3c;">)</span>
<span style="color: #606F73;">;; </span><span style="color: #606F73;">Define keybindings for multi-vterm in Doom Emacs</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">map!</span> <span style="color: #1abc9c;">:leader</span>
      <span style="color: #53df83;">(</span><span style="color: #1abc9c;">:prefix</span> <span style="color: #1abc9c;">(</span><span style="color: #53df83;">"t"</span> . <span style="color: #53df83;">"multi-vterm"</span><span style="color: #1abc9c;">)</span>
        <span style="color: #1abc9c;">:desc</span> <span style="color: #53df83;">"Open multi-vterm"</span> <span style="color: #53df83;">"t"</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">multi-vterm</span>
        <span style="color: #1abc9c;">:desc</span> <span style="color: #53df83;">"Next vterm"</span> <span style="color: #53df83;">"n"</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">multi-vterm-next</span>
        <span style="color: #1abc9c;">:desc</span> <span style="color: #53df83;">"Previous vterm"</span> <span style="color: #53df83;">"p"</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">multi-vterm-prev</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgccfb98c" class="outline-3">
<h3 id="orgccfb98c"><span class="section-number-3">7.7.</span> pixel-scroll</h3>
<div class="outline-text-3" id="text-7-7">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #606F73;">;; </span><span style="color: #606F73;">(pixel-scroll-mode 1)</span>
<span style="color: #606F73;">;; </span><span style="color: #606F73;">(good-scroll-mode 1)</span>
<span style="color: #e74c3c;">(</span><span style="color: #f8f8f0;">pixel-scroll-precision-mode</span> <span style="color: #56b5c2;">1</span><span style="color: #e74c3c;">)</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">(setq</span>
<span style="color: #606F73;">;;  </span><span style="color: #606F73;">scroll-conservatively 1000                     ;; only '</span><span style="color: #1abc9c;">jump</span><span style="color: #606F73;">' when moving this far</span>
<span style="color: #606F73;">;;  </span><span style="color: #606F73;">scroll-margin 4                                ;; scroll N lines to screen edge</span>
<span style="color: #606F73;">;;  </span><span style="color: #606F73;">scroll-step 1                                  ;; keyboard scroll one line at a time</span>
<span style="color: #606F73;">;;  </span><span style="color: #606F73;">mouse-wheel-scroll-amount '(6 ((shift) . 1))   ;; mouse scroll N lines</span>
<span style="color: #606F73;">;;  </span><span style="color: #606F73;">mouse-wheel-progressive-speed nil              ;; don't accelerate scrolling</span>

<span style="color: #606F73;">;;  </span><span style="color: #606F73;">redisplay-dont-pause t                         ;; don't pause display on input</span>

<span style="color: #606F73;">;;  </span><span style="color: #606F73;">;; Always redraw immediately when scrolling,</span>
<span style="color: #606F73;">;;  </span><span style="color: #606F73;">;; more responsive and doesn't hang!</span>
<span style="color: #606F73;">;;  </span><span style="color: #606F73;">fast-but-imprecise-scrolling nil</span>
<span style="color: #606F73;">;;  </span><span style="color: #606F73;">jit-lock-defer-time 0</span>
<span style="color: #606F73;">;;  </span><span style="color: #606F73;">)</span>

        <span style="color: #606F73;">;; </span><span style="color: #606F73;">scroll one line at a time (less "jumpy" than defaults)</span>
<span style="color: #606F73;">;; </span><span style="color: #606F73;">(setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ; one line at a time</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">mouse-wheel-progressive-speed</span> nil<span style="color: #e74c3c;">)</span>            <span style="color: #606F73;">; </span><span style="color: #606F73;">don't accelerate scrolling</span>
<span style="color: #606F73;">;; </span><span style="color: #606F73;">(setq-default smooth-scroll-margin 0)</span>
<span style="color: #606F73;">;; </span><span style="color: #606F73;">(setq scroll-step 1</span>
<span style="color: #606F73;">;;       </span><span style="color: #606F73;">scroll-margin 1</span>
<span style="color: #606F73;">;;       </span><span style="color: #606F73;">scroll-conservatively 100000) ;100000</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9a46dd0" class="outline-3">
<h3 id="org9a46dd0"><span class="section-number-3">7.8.</span> which key</h3>
<div class="outline-text-3" id="text-7-8">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">which-key-use-C-h-commands</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">t</span><span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfc8ef20" class="outline-3">
<h3 id="orgfc8ef20"><span class="section-number-3">7.9.</span> Set Icons For Dired</h3>
<div class="outline-text-3" id="text-7-9">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #606F73;">;; </span><span style="color: #606F73;">(all-the-icons-dired-mode 1)</span>
</pre>
</div>
</div>
</div>
