emacs-notes/.config/doom/config.org
** BOOKMARKS AND BUFFERS
Doom Emacs uses 'SPC b' for keybindings related to bookmarks and buffers.

Bookmarks are somewhat like registers in that they record positions you can jump to.  Unlike registers, they have long names, and they persist automatically from one Emacs session to the next. The prototypical use of bookmarks is to record where you were reading in various files.

| COMMAND         | DESCRIPTION                            | KEYBINDING |
|-----------------+----------------------------------------+------------|
| list-bookmarks  | /List bookmarks/                         | SPC b L    |
| bookmark-set    | /Set bookmark/                           | SPC b m    |
| bookmark-delete | /Delete bookmark/                        | SPC b M    |
| bookmark-save   | /Save current bookmark to bookmark file/ | SPC b w    |

#+BEGIN_SRC emacs-lisp
(setq bookmark-default-file "~/.config/doom/bookmarks")

(map! :leader
      (:prefix ("b". "buffer")
       :desc "List bookmarks"                          "L" #'list-bookmarks
       :desc "Set bookmark"                            "m" #'bookmark-set
       :desc "Delete bookmark"                         "M" #'bookmark-delete
       :desc "Save current bookmarks to bookmark file" "w" #'bookmark-save))
#+END_SRC
** MU4E
#+begin_src elisp
(add-to-list 'load-path "/usr/share/emacs/site-lisp/mu4e")
#+end_src
* theme
+ list of doom-theme
#+begin_src elisp
;; (setq doom-theme 'doom-one)
;; (setq doom-theme 'doom-henna)

(setq doom-theme 'catppuccin)
;; (setq catppuccin-flavor latte) ;; or 'latte, 'macchiato, or 'mocha 'frappe
;; (catppuccin-reload)
#+end_src

* wks-mode-SH
https://github.com/3L0C/wks-mode.git
#+begin_src elisp
(use-package! wks-mode)
#+end_src


** flyspell enable
#+begin_src elisp
;; Set the location of aspell executable
(setq ispell-program-name "aspell")
;; (setq ispell-program-name "hunspell")

;; Set the default dictionary
(setq ispell-dictionary "en_US")
;; (setq ispell-local-dictionary "en_US")

;; Load Wucuo and set up hooks for programming and text modes
(after! wucuo
  (add-hook 'prog-mode-hook #'wucuo-start)
  (add-hook 'text-mode-hook #'wucuo-start))

;; Disable flyspell-mode and flyspell-prog-mode if enabled
(setq flyspell-mode nil)
(setq flyspell-prog-mode nil)

;; Configure Wucuo behavior
(setq wucuo-flyspell-start-mode 'fast) ;; Use 'normal' for more comprehensive checking
(setq wucuo-update-interval 5) ;; Adjust the interval as needed

;; Skip spell checking in certain modes
(setq wucuo-spell-check-buffer-predicate
      (lambda ()
        (not (memq major-mode
                   '(dired-mode
                     log-edit-mode
                     compilation-mode
                     help-mode
                     profiler-report-mode
                     speedbar-mode
                     gud-mode
                     calc-mode
                     Info-mode)))))
#+end_src
* colorful-mode
#+begin_src elisp
;; ~/.doom.d/config.el or ~/.config/doom/config.el
(use-package! colorful-mode
  :hook (prog-mode text-mode))
#+end_src

* dashboard in doom eamcs
#+begin_src elisp
;; (dolist (item '("Recently opened files"
;;                  "Reload last session"
;;                  "Open org-agenda"
;;                  "Open project"
;;                  "Jump to bookmark"
;;                  "Open private configuration"
;;                  "Open documentation"))
;;   (setq +doom-dashboard-menu-sections
;;         (assoc-delete-all item +doom-dashboard-menu-sections)))
;; (setq +doom-dashboard-name)

;; alternative way to do ⬇
;; (assoc-delete-all "Jump to bookmark" +doom-dashboard-menu-sections)
;; (assoc-delete-all "Open private configuration" +doom-dashboard-menu-sections)
;; (assoc-delete-all "Open documentation" +doom-dashboard-menu-sections)


  ;;set img
  ;; (setq fancy-splash-image (concat doom-private-dir "logo1.svg"))

  ;; set Dashboard asci
  ;; (defun my-weebery-is-always-greater ()
  ;;   (let* ((banner '("⢸⣿⣿⣿⣿⠃⠄⢀⣴⡾⠃⠄⠄⠄⠄⠄⠈⠺⠟⠛⠛⠛⠛⠻⢿⣿⣿⣿⣿⣶⣤⡀⠄"
  ;;                    "⢸⣿⣿⣿⡟⢀⣴⣿⡿⠁⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣸⣿⣿⣿⣿⣿⣿⣿⣷"
  ;;                    "⢸⣿⣿⠟⣴⣿⡿⡟⡼⢹⣷⢲⡶⣖⣾⣶⢄⠄⠄⠄⠄⠄⢀⣼⣿⢿⣿⣿⣿⣿⣿⣿⣿"
  ;;                    "⢸⣿⢫⣾⣿⡟⣾⡸⢠⡿⢳⡿⠍⣼⣿⢏⣿⣷⢄⡀⠄⢠⣾⢻⣿⣸⣿⣿⣿⣿⣿⣿⣿"
  ;;                    "⡿⣡⣿⣿⡟⡼⡁⠁⣰⠂⡾⠉⢨⣿⠃⣿⡿⠍⣾⣟⢤⣿⢇⣿⢇⣿⣿⢿⣿⣿⣿⣿⣿"
  ;;                    "⣱⣿⣿⡟⡐⣰⣧⡷⣿⣴⣧⣤⣼⣯⢸⡿⠁⣰⠟⢀⣼⠏⣲⠏⢸⣿⡟⣿⣿⣿⣿⣿⣿"
  ;;                    "⣿⣿⡟⠁⠄⠟⣁⠄⢡⣿⣿⣿⣿⣿⣿⣦⣼⢟⢀⡼⠃⡹⠃⡀⢸⡿⢸⣿⣿⣿⣿⣿⡟"
  ;;                    "⣿⣿⠃⠄⢀⣾⠋⠓⢰⣿⣿⣿⣿⣿⣿⠿⣿⣿⣾⣅⢔⣕⡇⡇⡼⢁⣿⣿⣿⣿⣿⣿⢣"
  ;;                    "⣿⡟⠄⠄⣾⣇⠷⣢⣿⣿⣿⣿⣿⣿⣿⣭⣀⡈⠙⢿⣿⣿⡇⡧⢁⣾⣿⣿⣿⣿⣿⢏⣾"
  ;;                    "⣿⡇⠄⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⢻⠇⠄⠄⢿⣿⡇⢡⣾⣿⣿⣿⣿⣿⣏⣼⣿"
  ;;                    "⣿⣷⢰⣿⣿⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⢰⣧⣀⡄⢀⠘⡿⣰⣿⣿⣿⣿⣿⣿⠟⣼⣿⣿"
  ;;                    "⢹⣿⢸⣿⣿⠟⠻⢿⣿⣿⣿⣿⣿⣿⣿⣶⣭⣉⣤⣿⢈⣼⣿⣿⣿⣿⣿⣿⠏⣾⣹⣿⣿"
  ;;                    "⢸⠇⡜⣿⡟⠄⠄⠄⠈⠙⣿⣿⣿⣿⣿⣿⣿⣿⠟⣱⣻⣿⣿⣿⣿⣿⠟⠁⢳⠃⣿⣿⣿"
  ;;                    "⠄⣰⡗⠹⣿⣄⠄⠄⠄⢀⣿⣿⣿⣿⣿⣿⠟⣅⣥⣿⣿⣿⣿⠿⠋⠄⠄⣾⡌⢠⣿⡿⠃"
  ;;                    "⠜⠋⢠⣷⢻⣿⣿⣶⣾⣿⣿⣿⣿⠿⣛⣥⣾⣿⠿⠟⠛⠉⠄⠄          "))
  ;;          (longest-line (apply #'max (mapcar #'length banner))))
  ;;     (put-text-property
  ;;      (point)
  ;;      (dolist (line banner (point))
  ;;        (insert (+doom-dashboard--center
  ;;                 +doom-dashboard--width
  ;;                 (concat line (make-string (max 0 (- longest-line (length line))) 32)))
  ;;                "\n"))
  ;;      'face 'doom-dashboard-banner)))
  ;; (setq +doom-dashboard-ascii-banner-fn #'my-weebery-is-always-greater)

#+end_src

#+RESULTS:
| Recently opened files | :icon | (nerd-icons-faicon nf-fa-file_text :face 'doom-dashboard-menu-title) | :action | recentf-open-files |
