emacs-notes/.config/doom/config.html
<div id="outline-container-orgb4c1822" class="outline-3">
<h3 id="orgb4c1822"><span class="section-number-3">7.10.</span> BOOKMARKS AND BUFFERS</h3>
<div class="outline-text-3" id="text-7-10">
<p>
Doom Emacs uses &rsquo;SPC b&rsquo; for keybindings related to bookmarks and buffers.
</p>

<p>
Bookmarks are somewhat like registers in that they record positions you can jump to.  Unlike registers, they have long names, and they persist automatically from one Emacs session to the next. The prototypical use of bookmarks is to record where you were reading in various files.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">COMMAND</th>
<th scope="col" class="org-left">DESCRIPTION</th>
<th scope="col" class="org-left">KEYBINDING</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">list-bookmarks</td>
<td class="org-left"><i>List bookmarks</i></td>
<td class="org-left">SPC b L</td>
</tr>

<tr>
<td class="org-left">bookmark-set</td>
<td class="org-left"><i>Set bookmark</i></td>
<td class="org-left">SPC b m</td>
</tr>

<tr>
<td class="org-left">bookmark-delete</td>
<td class="org-left"><i>Delete bookmark</i></td>
<td class="org-left">SPC b M</td>
</tr>

<tr>
<td class="org-left">bookmark-save</td>
<td class="org-left"><i>Save current bookmark to bookmark file</i></td>
<td class="org-left">SPC b w</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">bookmark-default-file</span> <span style="color: #53df83;">"~/.config/doom/bookmarks"</span><span style="color: #e74c3c;">)</span>

<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">map!</span> <span style="color: #1abc9c;">:leader</span>
      <span style="color: #53df83;">(</span><span style="color: #1abc9c;">:prefix</span> <span style="color: #1abc9c;">(</span><span style="color: #53df83;">"b"</span>. <span style="color: #53df83;">"buffer"</span><span style="color: #1abc9c;">)</span>
       <span style="color: #1abc9c;">:desc</span> <span style="color: #53df83;">"List bookmarks"</span>                          <span style="color: #53df83;">"L"</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">list-bookmarks</span>
       <span style="color: #1abc9c;">:desc</span> <span style="color: #53df83;">"Set bookmark"</span>                            <span style="color: #53df83;">"m"</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">bookmark-set</span>
       <span style="color: #1abc9c;">:desc</span> <span style="color: #53df83;">"Delete bookmark"</span>                         <span style="color: #53df83;">"M"</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">bookmark-delete</span>
       <span style="color: #1abc9c;">:desc</span> <span style="color: #53df83;">"Save current bookmarks to bookmark file"</span> <span style="color: #53df83;">"w"</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">bookmark-save</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org157ca53" class="outline-3">
<h3 id="org157ca53"><span class="section-number-3">7.11.</span> MU4E</h3>
<div class="outline-text-3" id="text-7-11">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #e74c3c;">(</span><span style="color: #e74c3c;">add-to-list</span> <span style="color: #e74c3c;">'</span><span style="color: #f8f8f0;">load-path</span> <span style="color: #53df83;">"/usr/share/emacs/site-lisp/mu4e"</span><span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6d7d0c5" class="outline-2">
<h2 id="org6d7d0c5"><span class="section-number-2">8.</span> theme</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>list of doom-theme</li>
</ul>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #606F73;">;; </span><span style="color: #606F73;">(setq doom-theme 'doom-one)</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">doom-theme</span> <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">doom-henna</span><span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7f28c75" class="outline-2">
<h2 id="org7f28c75"><span class="section-number-2">9.</span> wks-mode-SH</h2>
<div class="outline-text-2" id="text-9">
<p>
<a href="https://github.com/3L0C/wks-mode.git">https://github.com/3L0C/wks-mode.git</a>
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">use-package!</span> wks-mode<span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
<div id="outline-container-orgf48b92a" class="outline-3">
<h3 id="orgf48b92a"><span class="section-number-3">9.1.</span> flyspell enable</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #606F73;">;; </span><span style="color: #606F73;">Set the location of aspell executable</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">ispell-program-name</span> <span style="color: #53df83;">"aspell"</span><span style="color: #e74c3c;">)</span>
<span style="color: #606F73;">;; </span><span style="color: #606F73;">(setq ispell-program-name "hunspell")</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">Set the default dictionary</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">ispell-dictionary</span> <span style="color: #53df83;">"en_US"</span><span style="color: #e74c3c;">)</span>
<span style="color: #606F73;">;; </span><span style="color: #606F73;">(setq ispell-local-dictionary "en_US")</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">Load Wucuo and set up hooks for programming and text modes</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">after!</span> wucuo
  <span style="color: #53df83;">(</span><span style="color: #e74c3c;">add-hook</span> <span style="color: #e74c3c;">'</span><span style="color: #f8f8f0;">prog-mode-hook</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">wucuo-start</span><span style="color: #53df83;">)</span>
  <span style="color: #53df83;">(</span><span style="color: #e74c3c;">add-hook</span> <span style="color: #e74c3c;">'</span><span style="color: #f8f8f0;">text-mode-hook</span> <span style="color: #e74c3c;">#'</span><span style="color: #e74c3c;">wucuo-start</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">Disable flyspell-mode and flyspell-prog-mode if enabled</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> <span style="color: #f8f8f0;">flyspell-mode</span> nil<span style="color: #e74c3c;">)</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> flyspell-prog-mode nil<span style="color: #e74c3c;">)</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">Configure Wucuo behavior</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> wucuo-flyspell-start-mode <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">fast</span><span style="color: #e74c3c;">)</span> <span style="color: #606F73;">;; </span><span style="color: #606F73;">Use '</span><span style="color: #1abc9c;">normal</span><span style="color: #606F73;">' for more comprehensive checking</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> wucuo-update-interval <span style="color: #56b5c2;">5</span><span style="color: #e74c3c;">)</span> <span style="color: #606F73;">;; </span><span style="color: #606F73;">Adjust the interval as needed</span>

<span style="color: #606F73;">;; </span><span style="color: #606F73;">Skip spell checking in certain modes</span>
<span style="color: #e74c3c;">(</span><span style="color: #1abc9c;">setq</span> wucuo-spell-check-buffer-predicate
      <span style="color: #53df83;">(</span><span style="color: #1abc9c;">lambda</span> <span style="color: #1abc9c;">()</span>
        <span style="color: #1abc9c;">(</span><span style="color: #1abc9c;">not</span> <span style="color: #53df83;">(</span><span style="color: #1abc9c;">memq</span> <span style="color: #f8f8f0;">major-mode</span>
                   <span style="color: #e74c3c;">'</span><span style="color: #e74c3c;">(</span>dired-mode
                     log-edit-mode
                     compilation-mode
                     help-mode
                     profiler-report-mode
                     speedbar-mode
                     gud-mode
                     calc-mode
                     Info-mode<span style="color: #e74c3c;">)</span><span style="color: #53df83;">)</span><span style="color: #1abc9c;">)</span><span style="color: #53df83;">)</span><span style="color: #e74c3c;">)</span>
</pre>
</div>
</div>
</div>
</div>
